# Pandas

In [43]:
import numpy as np
import pandas as pd

In [65]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#### 0. Создать датафрейм.

In [45]:
df = pd.DataFrame(data)

#### 1. Вывести информацию о датафрейме.

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [47]:
df.head(3)

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no

#### 3. Выберите только столбцы 'animal' и 'age' из DataFrame `df`.

In [48]:
df[['animal', 'age']]

  animal  age
0    cat  2.5
1    cat  3.0
2  snake  0.5
3    dog  NaN
4    dog  5.0
5    cat  2.0
6  snake  4.5
7    cat  NaN
8    dog  7.0
9    dog  3.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['animal', 'age']`.

In [49]:
columns = ['animal', 'age']
rows = [3, 4, 8]

df.iloc[rows][columns]

  animal  age
3    dog  NaN
4    dog  5.0
8    dog  7.0

#### 5. Выберите строки где количество посещений больше 3.

In [50]:
flag = df['visits'] > 3
df[flag]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

#### 6. Выберите строки, в которых отсутствует возраст.

In [51]:
flag = df['age'].isnull()
df[flag]

  animal  age  visits priority
3    dog  NaN       3      yes
7    cat  NaN       1      yes

#### 7. Выберите строки, в которых животное является кошкой * и * возраст составляет менее 3 лет.

In [66]:
flag = (df['animal'] == 'cat') & (df['age'] < 3)
df[flag]

  animal  age  visits priority
a    cat  2.5     1.0      Yes
f    cat  1.5     3.0       No

#### 8. Выберите строки в которых возраст от 2 до 4 (включительно).

In [67]:
flag = (df['age'] >= 2) & (df['age'] <= 4)
df[flag]

  animal  age  visits priority
a    cat  2.5     1.0      Yes
b    cat  3.0     3.0      Yes
j    dog  3.0     1.0       No

#### 9. Измените возраст в строке 'f' на 1,5.

In [68]:
df = pd.DataFrame(data, index=labels)
df.loc['f', 'age'] = 1.5
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 10. Рассчитать общее количество всех посещений.

In [69]:
df['visits'].sum()

19

#### 11. Расчитайте суммарный возраст животных

In [70]:
df['age'].sum()

27.0

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [71]:
df.loc['k'] = np.arange(4) 
print(df)
df = df.drop('k')
print(df)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
k      0  1.0       2        3
  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 13. Подсчитайте количество животных каждого типа в `df`.

In [72]:
a = set(df['animal'])

for animal in a:
  print(animal, len(df[df['animal'] == animal]['animal']))

cat 4
dog 4
snake 2

#### 14. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

In [73]:
df.sort_values(by=['age', 'visits'], ascending=[True, True])

  animal  age  visits priority
c  snake  0.5       2       no
f    cat  1.5       3       no
a    cat  2.5       1      yes
j    dog  3.0       1       no
b    cat  3.0       3      yes
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

#### 15. В столбце приоритет замените значения на `Yes` и `No`

In [74]:
ind = 0
for i in df.priority:
  if i == 'no':
    df.loc[labels[ind], 'priority'] = 'No'
  elif i == 'yes':
    df.loc[labels[ind], 'priority'] = 'Yes'
  ind += 1

df

  animal  age  visits priority
a    cat  2.5       1      Yes
b    cat  3.0       3      Yes
c  snake  0.5       2       No
d    dog  NaN       3      Yes
e    dog  5.0       2       No
f    cat  1.5       3       No
g  snake  4.5       1       No
h    cat  NaN       1      Yes
i    dog  7.0       2       No
j    dog  3.0       1       No

#### 16. В столбце «animal» измените записи «snake» на «python».

In [75]:
ind = 0
for i in df['animal']:
  if i == 'snake':
    df.loc[labels[ind], 'animal'] = 'python'
  ind += 1

df

   animal  age  visits priority
a     cat  2.5       1      Yes
b     cat  3.0       3      Yes
c  python  0.5       2       No
d     dog  NaN       3      Yes
e     dog  5.0       2       No
f     cat  1.5       3       No
g  python  4.5       1       No
h     cat  NaN       1      Yes
i     dog  7.0       2       No
j     dog  3.0       1       No

#### 17. Удалите все повторения строк из таблицы
```python
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

In [76]:
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df.drop_duplicates()

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

#### 20. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [86]:
l = list('abcdefghij')
df = pd.DataFrame(np.random.random (size = (5, 10)), columns = l)
print(df)
data = [df[i].sum() for i in l]
print(min(data), l[data.index(min(data))])

          a         b         c  ...         h         i         j
0  0.171021  0.848990  0.708685  ...  0.992189  0.619309  0.572537
1  0.728180  0.217923  0.709174  ...  0.378681  0.092180  0.888497
2  0.231372  0.293873  0.017104  ...  0.980160  0.369222  0.033031
3  0.516827  0.924094  0.027621  ...  0.887210  0.731579  0.745114
4  0.831888  0.331336  0.795305  ...  0.438844  0.817863  0.128447

[5 rows x 10 columns]
1.3748889297637903 g

#### 21. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [26]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})

df.fillna(df.median(), inplace = True)
df

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    3.0
4      a    2.0
5      b    3.0
6      b    3.0
7      b    1.0
8      a    7.0
9      b    3.0
10     a    3.0
11     b    8.0

#### 22. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

In [27]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})

In [38]:
from_ = []
to_ = []
for i in range(len(df.From_To)):
  from_to = df.From_To[i].split('_')
  from_.append(from_to[0].capitalize())
  to_.append(from_to[1].capitalize())

df['From'] = from_
df['To'] = to_
df.drop('From_To', axis=1, inplace=True)
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London